export default {
    "regularTree":[
 
    {
        "name":"数学表达式校验",
        "code":"1",
        "id":"1",
        "child":[
            {"name":"至少n位的数字","code":"^\\d{n,}$","id":"1-1","memo":"6位以上数字，^\\d{6,}$"},
            {"name":"m-n位的数字","code":"^\\d{m,n}$","id":"1-2","memo":"3-8位的数字：^\\d{3,8}$"},
            {"name":"零和非零开头的数字","code":"^(0|[1-9][0-9]*)$","id":"1-3","memo":"零和非零开头的数字：^(0|[1-9][0-9]*)$"},
            {"name":"非零开头的最多带 n 位小数的数字","code":"^([1-9][0-9]*)+(\\.[0-9]{1,n})?$","id":"1-4","memo":"非零开头最多带 2 位小数的数字:^([1-9][0-9]*)+(\\.[0-9]{1,2})?$"},
            {"name":"非零的负整数","code":"^-[1-9]\\d*$","id":"1-5","memo":"小于零的负整数"},
            {"name":"非零的正整数","code":"^[1-9]\\d*$","id":"1-6","memo":"大于零的整数：^[1-9]\\d*$ 或 ^([1-9][0-9]*){1,3}$ 或 ^\\+?[1-9][0-9]*$"},
            {"name":"非负整数","code":"^\\d+$","id":"1-7","memo":"非负整数：^\\d+$ 或 ^[1-9]\\d*|0$"},
            {"name":"非正整数","code":"^-[1-9]\\d*|0","id":"1-8","memo":"非正整数：^-[1-9]\\d*|0$ 或 ^((-\\d+)|(0+))$"},
            {"name":"正浮点数","code":"^[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*$","id":"1-9","memo":"正浮点数：^[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*$"},
            {"name":"负浮点数","code":"^-([1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*)$","id":"1-10","memo":"负浮点数：^-([1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*)$ "},
            {"name":"浮点数","code":"^(-?\\d+)(\\.\\d+)?$ ","id":"1-11","memo":"浮点数：^(-?\\d+)(\\.\\d+)?$ "},
          
        ]
    },
    {
        "name":"字符串校验",
        "code":"2",
        "id":"2",
        "child":[
            {"name":"中文字符组成的字符串","code":"^[\u4e00-\u9fa5]{0,}$","id":"2-1","memo":"2-6位中文名：^[\u4e00-\u9fa5]{2,6}$"},
            {"name":"长度为3-20的字符串","code":"^.{3,20}$","id":"2-2","memo":"长度为3-20的字符串：^.{3,20}$"},
            {"name":"由26个英文字母组成的字符串","code":"^[A-Za-z]+$","id":"2-3","memo":"由26个英文字母组成的字符串：^[A-Za-z]+$"},
            {"name":"26个英文字母和数字组成的字符串","code":"^[A-Za-z0-9]+$","id":"2-4","memo":"26个英文字母和数字组成的字符串：^[A-Za-z0-9]+$"},
            {"name":"数字、26个英文字母或下划线组成的字符串","code":"^\\w+$","id":"2-5","memo":"由数字、26个英文字母或者下划线组成的字符串：^\\w+$ 或 ^\\w{3,20}$"},
            {"name":"中文、英文、数字包括下划线组成的字符串","code":"^[\u4E00-\u9FA5A-Za-z0-9_]+$","id":"2-6","memo":"中文、英文、数字包括下划线组成字符串：^[\u4E00-\u9FA5A-Za-z0-9_]+$"},
            {"name":"中文、英文、数字但不包括下划线等组成的字符串","code":"^[\u4E00-\u9FA5A-Za-z0-9]+$ ","id":"2-7","memo":"中文、英文、数字但不包括下划线等组成的字符串：^[\u4E00-\u9FA5A-Za-z0-9]+$ "},
            
        ]
    },
    {
        "name":"账号密码校验",
        "code":"3",
        "id":"3",
        "child":[
            {"name":"帐号(字母开头，5-16字节，允许字母数字下划线)","code":"^[a-zA-Z][a-zA-Z0-9_]{4,15}$","id":"3-1","memo":"帐号(字母开头，5-16字节，允许字母数字下划线)：^[a-zA-Z][a-zA-Z0-9_]{4,15}$"},
            {"name":"密码(字母开头，长度6~18，含字母、数字和下划线)","code":"^[a-zA-Z]\\w{5,17}$","id":"3-2","memo":"密码(字母开头，长度6~18，含字母、数字和下划线)：^[a-zA-Z]\\w{5,17}$"},
            {"name":"强密码(大小写和数字组合，不使用特殊字符，长度 8~10 )","code":"^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z0-9]{8,10}$","id":"3-3","memo":"强密码(大小写和数字组合，不使用特殊字符，长度 8~10 )：^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z0-9]{8,10}$"},
            {"name":"强密码(含大小写和数字组合，可使用特殊字符，长度8-10)","code":"^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$","id":"3-4","memo":"强密码(含大小写和数字组合，可使用特殊字符，长度8-10)：^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$"},
            
        ]
    },
    {
        "name":"联系方式校验",
        "code":"4",
        "id":"4",
        "child":[
            {"name":"手机号码（中国大陆","code":"^(13[0-9]|14[5|7]|15[0-9]|18[0-9])\\d{8}$","id":"4-1","memo":"手机号码（中国大陆）：^(13[0-9]|14[5|7]|15[0-9]|18[0-9])\\d{8}$，例如 136xxxxxxxx"},
            {"name":"电话号码（国际上）","code":"^(\\(\\d{3,4}-)|\\d{3.4}-)?\\d{7,8}$","id":"4-2","memo":"匹配形式如 ('XXX-XXXXXXX'、'XXXX-XXXXXXX'、'XXX-XXXXXXXX'、'XXXX-XXXXXXXX'、'XXXXXXX'和'XXXXXXXX)"},
            {"name":"固定电话号码（中国大陆）","code":"\\d{3}-\\d{8}|\\d{4}-\\d{7}","id":"4-3","memo":"固定电话号码（中国大陆）:\\d{3}-\\d{8}|\\d{4}-\\d{7} , 匹配形式如 0511-4405222 或 021-87888822"},

        ]
    },
    {
        "name":"个人身份校验",
        "code":"5",
        "id":"5",
        "child":[
            {"name":"身份证号(15位、18位数字)","code":"(^\\d{15}$)|(^\\d{18}$)|(^\\d{17}(\\d|X|x)$)","id":"5-1","memo":"身份证号(15位、18位数字)，最后一位是校验位，可以为X"},
            {"name":"QQ号","code":"[1-9][0-9]{4,11}","id":"5-2","memo":"腾讯QQ号从10000开始"},
            {"name":"邮政编码","code":"^[1-9]\\d{5}(?!\\d)","id":"5-3","memo":"中国邮政编码为6位数字"},
            {"name":"Email地址","code":"^[A-Za-z0-9-._]+@[A-Za-z0-9-]+(\\.[A-Za-z0-9]+)*(\\.[A-Za-z]{2,6})$","id":"5-4","memo":"邮箱地址"},
        ]
    },
    {
        "name":"网站信息校验",
        "code":"6",
        "id":"6",
        "child":[
            {"name":"IPv4地址","code":"((2(5[0-5]|[0-4]\\d))|[0-1]?\\d{1,2})(\\.((2(5[0-5]|[0-4]\\d))|[0-1]?\\d{1,2})){3}","id":"6-1","memo":"IPv4地址的匹配形式如下：192.168.56.1"},
            {"name":"域名","code":"[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\\.?","id":"6-2","memo":"域名的匹配形式如下：www.yonyou.com"},
            {"name":"IP地址","code":"/^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/","id":"6-3","memo":"IP地址：/^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)、\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/"},
            {"name":"InternetURL","code":"((([A-Za-z]{3,9}:(?:\\/\\/)?)(?:[-;:&=\\+\\$,\\w]+@)?[A-Za-z0-9.-]+(:[0-9]+)?|(?:ww‌​w.|[-;:&=\\+\\$,\\w]+@)[A-Za-z0-9.-]+)((?:\\/[\\+~%\\/.\\w-_]*)?\\??(?:[-\\+=&;%@.\\w_]*)#?‌​(?:[\\w]*))?)","id":"6-4","memo":"URL地址"},
        ]
    },
]
    
} 